{
    "101": {
        "name": "Hạm đội đầu tiên!",
        "desc": "Có 2 tàu trong hạm đội chính."
    },
    "102": {
        "name": "Thành lập hạm đội Khu trục!",
        "desc": "Có 4 Khu trục hạm trong hạm đội chính."
    },
    "103": {
        "name": "Thành lập Thủy lôi chiến đội!",
        "desc": "Có 1 CL làm kỳ hạm và 5 DD trong hạm đội chính."
    },
    "104": {
        "name": "Thành lập hạm đội 6 tàu!",
        "desc": "Có 6 tàu trong hạm đội chính."
    },
    "105": {
        "name": "Thành lập hạm đội 2 CL!",
        "desc": "Có 2 CL trong hạm đội chính."
    },
    "106": {
        "name": "Thành lập hạm đội Tuần dương hạng nặng!",
        "desc": "Có 2 CA trong hạm đội chính."
    },
    "107": {
        "name": "Thành lập Không mẫu Cơ động Bộ đội!",
        "desc": "Có 1 CV/CVL làm kì hạm và 3 DD trong hạm đội chính."
    },
    "108": {
        "name": "Thành lập lớp Tenryuu!",
        "desc": "Có Tenryuu (天龍) và Tatsuta (龍田) trong hạm đội chính."
    },
    "109": {
        "name": "Thành lập lớp Sendai!",
        "desc": "Có Sendai (川内), Jintsuu (神通) và Naka (那珂) trong hạm đội chính."
    },
    "110": {
        "name": "Thành lập lớp Myoukou!",
        "desc": "Có Myoukou (妙高), Nachi (那智), Ashigara (足柄) và Haguro (羽黒) trong hạm đội chính."
    },
    "111": {
        "name": "Thành lập lớp Fusou!",
        "desc": "Có Fusou (扶桑) và Yamashiro (山城) trong hạm đội chính."
    },
    "112": {
        "name": "Thành lập lớp Ise!",
        "desc": "Có Ise (伊勢) và Hyuuga (日向) trong hạm đội chính."
    },
    "113": {
        "name": "Thành lập hạm đội Chính với BB và CA!",
        "desc": "Có 1 BB và 2 CA trong hạm đội chính."
    },
    "114": {
        "name": "Thành lập Nam Vân Cơ động Bộ đội!",
        "desc": "Chỉ có Akagi (赤城), Kaga (加賀), Hiryuu (飛龍) và Souryuu (蒼龍) trong hạm đội chính."
    },
    "115": {
        "name": "Thành lập hạm đội thứ 2!",
        "desc": "Có 1 mẫu hạm ở trong hạm đội thứ 2."
    },
    "116": {
        "name": "Có 1 Thuỷ phi cơ mẫu hạm",
        "desc": "Có 1 AV trong hạm đội chính."
    },
    "117": {
        "name": "Thành lập Không mẫu Cơ động Bộ đội ở hạm đội thứ 2!",
        "desc": "Có 1 CV/CVL và 3 DD trong hạm đội thứ 2."
    },
    "118": {
        "name": "Thành lập lớp Kongou!",
        "desc": "Có Kongou (金剛), Hiei (比叡), Haruna (榛名) và Kirishima (霧島) trong hạm đội chính."
    },
    "119": {
        "name": "Thành lập hạm đội Mikawa!",
        "desc": "Có Choukai (鳥海), Aoba (青葉), Kako (加古), Furutaka (古鷹), Tenryuu (天龍) và 1 tàu tốc độ cao trong hạm đội chính."
    },
    "120": {
        "name": "Thành lập Hạm đội Khu trục số 6!",
        "desc": "Chỉ có Akatsuki (暁), Hibiki (響), Inazuma (雷) và Ikazuchi (電) trong hạm đội chính."
    },
    "121": {
        "name": "Thành lập Hạm đội Tuần dương số 4!",
        "desc": "Có Atago (愛宕), Takao (高雄), Choukai (鳥海) và Maya (摩耶) trong hạm đội chính."
    },
    "122": {
        "name": "Thành lập Hạm đội Nishimura!",
        "desc": "Có Fusou (扶桑), Yamashiro (山城), Mogami (最上) và Shigure (時雨) trong hạm đội chính."
    },
    "123": {
        "name": "Thành lập Hạm đội Mẫu hạm đội 5!",
        "desc": "Có Shoukaku (翔鶴), Zuikaku (瑞鶴) và 2 DD trong hạm đội chính."
    },
    "124": {
        "name": "Thành lập Hạm đội Mikawa kiểu mới!",
        "desc": "Có Choukai (鳥海), Aoba (青葉), Kinugasa (衣笠), Kako (加古), Furutaka (古鷹) và Tenryuu (天龍) trong hạm đội chính."
    },
    "125": {
        "name": "Thành lập 1 hạm đội tàu ngầm!",
        "desc": "Có 2 SS trong hạm đội chính."
    },
    "126": {
        "name": "Thành lập 1 Hạm đội Không vận!",
        "desc": "Có 2 BBV và 2 CAV trong hạm đội chính."
    },
    "127": {
        "name": "Thành lập 1 Hạm đội tàu ngầm cỡ Trung!",
        "desc": "Có 3 SS trong hạm đội chính."
    },
    "128": {
        "name": "Thành lập Hạm đội Tuần dương số 6!",
        "desc": "Có Furutaka (古鷹), Kako(加古), Aoba (青葉) và Kinugasa (衣笠) trong hạm đội chính."
    },
    "129": {
        "name": "Thành lập Hạm đội số 5!",
        "desc": "Có Nachi (那智), Ashigara (足柄), Tama (多摩), và Kiso (木曾) trong hạm đội."
    },
    "130": {
        "name": "Thành lập Hạm đội ngư lôi số 1!",
        "desc": "Có Abukuma (阿武隈), Akebono (曙), Ushio (潮), Kasumi (霞) và Shiranui (不知火) trong hạm đội."
    },
    "131": {
        "name": "Thành lập đội khu trục số 8!",
        "desc": "Có Asashio (朝潮), Michishio (満潮), Ooshio (大潮) và Arashio (荒潮) trong hạm đội."
    },
    "132": {
        "name": "Thành lập đội khu trục số 18!",
        "desc": "Có DUY NHẤT Kasumi (霞), Arare (霰), Kagerou (陽炎) và Shiranui (不知火) trong hạm đội."
    },
    "133": {
        "name": "Thành lập đội khu trục số 30 (Thế hệ thứ nhất)!",
        "desc": "Có DUY NHẤT Mutsuki (睦月), Kisaragi (如月), Yayoi (弥生) và Mochizuki (望月) trong hạm đội."
    },
    "134": {
        "name": "Chuẩn bị cho tình yêu! (Phần 3)",
        "desc": "Triển khai hạm đội với một tàu làm kì hạm có cấp độ cao (Lv.90~99)!"
    },
    "135": {
        "name": "Một hành trình mới!",
        "desc": "Tổ chức một hạm đội gồm 6 tàu trong đó có một tàu có cấp độ Lv.100 hoặc cao hơn làm kì hạm!"
    },
    "136": {
        "name": "Thành lập đội khu trục số 30 (Thế hệ thứ 2)",
        "desc": "Có duy nhất Mutsuki (睦月), Yayoi (弥生), Uzuki (卯月) và Mochizuki (望月) trong hạm đội."
    },
    "137": {
        "name": "Thành lập hạm đội số 5",
        "desc": "Có Myoukou (妙高), Nachi (那智) và Haguro (羽黒) trong hạm đội."
    },
    "138": {
        "name": "Thành lập Không đội 2 mới",
        "desc": "Có Hiryuu Kai Ni (飛龍改二, làm kì hạm), Souryuu (蒼龍) và 2 khu trục hạm trong hạm đội."
    },
    "139": {
        "name": "Thành lập đội tàu ngầm số 6",
        "desc": "Có 1 tàu tiếp liệu tàu ngầm và 4 (hoặc hơn) tàu ngầm trong hạm đội chính."
    },
    "140": {
        "name": "Thử RADAR mới!",
        "desc": "Có Myoukou Kai2 làm kì hạm trong hạm đội chính."
    },
    "141": {
        "name": "Tổ chức lại Không đội 2 được tăng cường",
        "desc": "Có Souryuu Kai-2 (蒼龍改二) làm kì hạm cùng với Hiryuu Kai-2 (飛龍改二) và 2 khu trục hạm trong hạm đội."
    },
    "142": {
        "name":" Thành lập Hải đoàn Thiết giáp hạm tinh nhuệ số 3",
        "desc": "Có cả bốn thiết giáp hạm kai 2 thuộc lớp Kongou trong hạm đội chính."
    },
    "143": {
        "name": "Triển khai 1 Mẫu hạm tiêu chuẩn mới",
        "desc": "Có Unryuu (雲龍) làm kì hạm."
    },
    "144": {
        "name": "Thành lập hạm đội Thiết giáp hạm chính quy: Hải đoàn số 2",
        "desc": "Có  tất cả các thiết giáp hạm thuộc lớp Nagato và lớp Fusou (và không có tàu nào khác) trong hạm đội chính."
    },
    "145": {
        "name": "Thành lập lực lượng Thiết giáp hạm chính quy",
        "desc": "Có 3 Thiết giáp hạm trong lớp Nagato, Fusou, Ise hoặc Yamato và 1 Tuần dương hạm hạng nhẹ trong hạm đội."
    },
    "146": {
        "name": "Chuẩn bị xưởng nâng cấp",
        "desc": "Có Akashi (明石) làm kì hạm trong hạm đội chính."
    },
    "147": {
        "name": "Thành lập hạm đội Nishimura",
        "desc": "Có Fusou (扶桑), Yamashiro (山城), Mogami (最上), Shigure (時雨) và Michishio (満潮) trong hạm đội chính."
    },
    "148": {
        "name": "Tổ chức hạm đội phản công",
        "desc": "Có Kasumi (霞) làm kì hạm, Ashigara (足柄), 1 CL và thêm 3 DD trong hạm đội chính."
    },
    "149": {
        "name": "Tổ chức hạm đội khu trục số 11",
        "desc": "Có 4 Khu trục hạm loại đặc biệt: Fubuki (吹雪), Shirayuki(白雪), Hatsuyuki (初雪) và Murakumo(叢雲) trong hạm đội chính. Một trong số đó phải là kì hạm."
    },
    "150": {
        "name": "Thành lập đội khu trục số 21!",
        "desc": "Có duy nhất Hatsuharu (初春), Nenohi (子日), Wakaba (若葉) và Hatsushimo (初霜) trong hạm đội chính."
    },
    "151": {
        "name": "Thành lập đội khu trục số 22",
        "desc": "Có duy nhất Satsuki (皐月), Fumizuki (文月), Nagatsuki (長月) và 1 khu trục hạm nữa trong hạm đội chính."
    },
    "152": {
        "name": "Thành lập Hạm đội Mikawa kiểu mới",
        "desc": "Có Choukai Kai2 làm kì hạm và 5 tàu bất kì trong số Aoba, Kinugasa, Kako, Furutaka, Tenryuu, Yuubari trong hạm đội chính"
    },
    "153": {
        "name": "Tổ chức lại Hải đoàn số 18!",
        "desc": "Có Tenryuu, Tatsuta và ít nhất 2 tàu khác trong hạm đội"
    },
    "154": {
        "name": "Tổ chức hạm đội tấn công mặt nước!",
        "desc": "Có Hiei, Kirishima, Nagara, Akatsuki, Ikazuchi, Inazuma trong hạm đội"
    },
    "155": {
        "name": "Thành lập đội khu trục số 6 mới!",
        "desc": "Có Akatsuki Kai2 làm kì hạm cùng với Hibiki/Bep, Ikazuchi, Inazuma trong hạm đội"
    },
    "156": {
        "name": "Đệ nhất phóng lôi Hải đoàn, Chuẩn bị cho một cuộc tấn công lên vùng biển phía Bắc",
        "desc": "Có Abukuma(Kai-2) làm kì hạm cùng với Hibiki/Вер, Hatsushimo, Wakaba, Samidare và Shimakaze trong hạm đội chính"
    },
    "157": {
        "name": "Đệ nhất phóng lôi Hải đoàn, chuẩn bị cho một cuộc tấn công nữa lên vùng biển phía Bắc!",
        "desc": "Có Abukuma Kai Ni là kì hạm cùng với Hibiki/Вер, Yuugumo, Naganami, Akigumo và Shimakaze trong hạm đội chính"
    },
    
    
    
    "202": {
        "name": "Xuất kích lần đầu!",
        "desc": "Triển khai hạm đội chính đi một map bất kì."
    },
    "203": {
        "name": "Bảo vệ vùng nước quanh Quận Cảng!",
        "desc": "Triển khai tới World 1-1 và hoàn thành map."
    },
    "204": {
        "name": "Xuất kích tới bờ biển quần đảo Nansei!",
        "desc": "Triển khai tới 1-2 và hoàn thành map."
    },
    "205": {
        "name": "Chặn đánh hạm đội tiên phong của địch!",
        "desc": "Triển khai tới World 1-2 sau khi đã đánh bại boss và hoàn thành map."
    },
    "206": {
        "name": "Triển khai Phóng lôi Hải đoàn!",
        "desc": "Triển khai 1 hạm đội có 1 CL làm kì hạm và 3 DD hộ tống."
    },
    "207": {
        "name": "Triển khai 1 Tuần dương hạm hạng nặng!",
        "desc": "Triển khai 1 hạm đội có 1 CA làm kì hạm."
    },
    "208": {
        "name": "Triển khai 1 Thiết giáp hạm!",
        "desc": "Triển khai 1 hạm đội có 1 BB làm kì hạm. BBV không được tính."
    },
    "209": {
        "name": "Triển khai Không mẫu Cơ động Bộ đội!",
        "desc": "Triển khai 1 hạm đội bao gồm 1 CV(L) làm kì hạm và 5 DD\/CL\/AV hộ tống."
    },
    "215": {
        "name": "Xuất kích hạm đội số 2!",
        "desc": "Triển khai hạm đội số 2 đi một map bất kì"
    },
    "217": {
        "name": "Đánh chìm Không mẫu địch!",
        "desc": "Đánh chìm một Hàng không Mẫu hạm của địch"
    },
    "219": {
        "name": "Triển khai hạm đội Mikawa!",
        "desc": "Triển khai 1 hạm đội bao gồm Choukai, Aoba, Kako, Furutaka, Tenryuu và một tàu có tốc độ nhanh khác."
    },
    "222": {
        "name": "Triển khai đội khu trục số 6!",
        "desc": "Triển khai 1 hạm đội gồm DUY NHẤT Akatsuki, Hibiki, Inazuma, và Ikazuchi."
    },
    "223": {
        "name": "Triển khai đội tuần dương số 4!",
        "desc": "Triển khai 1 hạm đội bao gồm Atago, Takao, Choukai, Maya và 2 tàu bất kì. Giành 1 chiến thắng trước boss 2-2 (B-rank trở lên)."
    },
    "224": {
        "name": "Triển khai hạm đội Nishimura!",
        "desc": "Triển khai 1 hạm đội bao gồm Fusou, Yamashiro, Mogami, Shigure và 2 tàu bất kì. Giành chiến thắng trước boss 2-3."
    },
    "225": {
        "name": "Triển khai Không đội 5!",
        "desc": "Triển khai 1 hạm đội gồm Shoukaku, Zuikaku và 4 tàu bất kì. Giành lấy 1 chiến thắng trước boss 3-1 (B-rank trở lên)."
    },
    "227": {
        "name": "Triển khai hạm đội Mikawa mới!",
        "desc": "Triển khai 1 hạm đội bao gồm Choukai, Aoba, Kinugasa, Kako, Furutaka và Tenryuu. Đạt 1 chiến thắng ở boss 2-3 ( B-rank trở lên)."
    },
    "231": {
        "name": "Triển khai 1 hạm đội tàu ngầm!",
        "desc": "Triển khai 1 hạm đội bao gồm 2 SS và 4 tàu tuỳ chọn. Giành 1 chiến thắng trước boss 2-3 ( B-rank trở lên)."
    },
    "232": {
        "name": " Triển khai 1 hạm đội không vận!",
        "desc": "Triển khai 1 hạm đội gồm có 2 BBV, 2 CAV và 2 tàu khác.Giành 1 chiến thắng trước boss 4-2 (B-rank trở lên) ."
    },
    "233": {
        "name": "Xuất kích đội tuần dương hạm số 6!",
        "desc": "Triển khai 1 hạm đội bao gồm  Furutaka, Kako, Kinugasa, Aoba và 2 tàu khác. Đạt 1 S rank ở boss 2-3."
    },
    "239": {
        "name": "Xuất kích đội khu trục số 8!",
        "desc": "Triển khai 1 hạm đội gồm Asashio, Michishio, Ooshio, Arashio và 2 tàu tuỳ chọn.Giành chiến thắng trước boss 2-3."
    },
    "240": {
        "name": "Triển khai đội khu trục số 18!",
        "desc": "Triển khai 1 hạm đội bao gồm Kasumi, Arare, Kagerou, Shiranui và 2 tàu tuỳ chọn. Giành 1 chiến thắng trước boss 3-1 (B-rank trở lên )."
    },
    "244": {
        "name": "Triển khai đội khu trục số 30 (Thế hệ thứ nhất)",
        "desc": "Triển khai 1 hạm đội bao gồm Mutsuki (睦月), Kisaragi (如月), Yayoi (弥生), Mochizuki (望月) và thêm nhiều nhất DD khác tới 3-2 và gặp boss. Yêu cầu đạt từ C-rank trở lên."
    },
    "245": {
        "name": "Chuẩn bị cho tình yêu! (Cuối cùng)",
        "desc": "Triển khai 1 hạm đội với kì hạm có cấp độ cao (Lv.90~99) tới 2-3 giành chiến thắng S rank ở boss node."
    },
    "246": {
        "name": "Nhiệm vụ đầu tiên cùng nhau!",
        "desc": "Triển khai hạm đội tới 4-3 với một tàu có Lv.100 hoặc cao hơn làm kì hạm và đạt chiến thắng S rank ở boss node."
    },
    "247": {
        "name": "Xuất kích một hạm đội Hàng không Thiết giáp hạm!",
        "desc": "Có 2 BBV trong hạm đội chính và giành chiến thắng boss World 4-4 một lần ( B-rank trở lên) "
    },
    "248": {
        "name": "Tuần tra chống ngầm của đội khu trục số 30",
        "desc": "Triển khai Mutsuki, Yayoi, Uzuki và Mochizuki tới 1-5 và vào được boss, đạt ít nhât 1 C rank."
    },
    "250": {
        "name": "Triển khai Không đội 2",
        "desc": "Triển khai Hiryuu Kai Ni (飛龍改二) làm kì hạm, Souryuu (蒼龍) và hai khu trục hạm tới 5-2. Có thể thêm hai tàu khác. Đạt chiến thắng S rank ở boss node."
    },
    "251": {
        "name": "Triển khai Không đội 2 tinh nhuệ",
        "desc": "Triển khai Souryuu Kai Ni (蒼龍改二) làm kì hạm, Hiryuu Kai Ni (飛龍改二) và hai khu trục hạm tới 4-3. Bạn có thể thêm hai tàu khác. Đạt chiến thắng S rank ở boss node."
    },
    "252": {
        "name": "Triển khai một hạm đội do Haruna dẫn đầu",
        "desc": "Triển khai 1 hạm đội với Haruna Kai Ni (榛名改二) làm kì hạm và thêm nhiều nhất 5 tàu khác tới World 5-1 và đạt S rank ở boss ."
    },
    "253": {
        "name": "Triển khai Không đoàn 601",
        "desc": "Triển khai 1 hạm đội với Unryuu Kai (雲龍改) làm kì hạm tới 5-2 và đạt S rank ở boss."
    },
    "254": {
        "name": "Triển khai đội Không mẫu hạng nhẹ",
        "desc": "Triển khai một hạm đội bao gồm 1-2 CVL, 1 CL và 3-4 DD tới 2-1 và đạt S rank ở boss node."
    },
    "255": {
        "name": "Triển khai 1 hạm đội phóng lôi tới quần đảo Bashi",
        "desc": "Triển khai 1 hạm đội bao gồm 1-2 CL (một trong số đó phải là kì hạm) và 4-5 DD tới 2-2. Đạt một chiến thắng ở boss ( B-rank trở lên) và đánh chìm kì hạm của địch."
    },
    "258": {
        "name": "Xuất kích Đệ nhị Hải đoàn",
        "desc": "Triển khai Nagato (長門), Mutsu (陸奥), Fusou (扶桑), Yamashiro (山城) và thêm nhiều nhất hai tàu khác tới 4-2. Đạt S rank hai lần ở boss node."
    },
    "260": {
        "name": "Triển khai hải đoàn Thiết giáp hạm ở vùng biển phía Bắc",
        "desc": "Triển khai 2 Thiết giáp hạm, 1 Không mẫu hạng nhẹ và thêm nhiều nhất 3 tàu khác tới 3-5 và đạt S rank  ở boss node."
    },
    "262": {
        "name": "Triển khai Hạm đội Nishimura tới vùng biển phía Nam",
        "desc": "Triển khai Fusou (扶桑), Yamashiro (山城), Mogami (最上), Shigure (時雨) và Michishio (満潮) (bạn cũng có thể thêm một tàu khác) tới 5-1 và đạt S rank ở boss node."
    },
    "263": {
        "name": "Triển khai hải đoàn số 6 tới vùng biển Tây Nam",
        "desc": "Triển khai Furutaka (古鷹), Kako (加古), Aoba (青葉), Kinugasa (衣笠) và thêm tối đa 2 tàu khác tới 2-5 và đạt S rank ở boss node."
    },
    "267": {
        "name": "Triển khai đội khu trục số 11",
        "desc": "Triển khai Fubuki (吹雪), Shirayuki(白雪), Hatsuyuki (初雪), Murakumo(叢雲) và thêm tối đa 2 tàu nữa tới 2-3 và đạt 1 chiến thắng ở boss node (B-rank trở lên)."
    },
    "268": {
        "name": "Tuần tra chống ngầm của đội khu trục số 11",
        "desc": "Triển khai Fubuki (吹雪), Shirayuki(白雪), Hatsuyuki (初雪) và Murakumo(叢雲) tới 1-5 và giành lấy ít nhất C-rank tại boss node."
    },
    "269": {
        "name": "Triển khai đội khu trục số 21",
        "desc": "Triển khai Hatsuharu (初春), Nenohi (子日), Wakaba (若葉) và Hatsushimo (初霜) và thêm nhiều nhất 2 tàu khác tới 3-1 và đạt S rank ở boss node."
    },
    "270": {
        "name": "Triển khai đội khu trục số 22",
        "desc": "Triển khai Satsuki (皐月), Fumizuki (文月), Nagatsuki (長月), 1 DD bất kì và thêm tối đa 2 tàu khác tới 1-4 và đạt S rank ở boss node."
    },
    "271": {
        "name": "Triển khai Hạm đội của Nachi",
        "desc": "Sortie 1 fleet with Nachi (那智) as flagship, Hatsushimo (初霜), Kasumi (霞), Ushio (潮), Akebono (曙) và một tàu tuỳ chọn tới 2-2 và đạt S rank ở boss node."
    },
    "272": {
        "name": "Triển khai Tuần dương hạm phòng không được cải tạo",
        "desc": "Triển khai 1 hạm đội bao gồm Maya (摩耶) Kai hoặc Kai2, 1 CL, 2 DD và thêm nhiều nhất 2 tàu khác tới 2-3 và đạt S rank tại boss node."
    },
    "273": {
        "name": "Triển khai Hạm đội Mikawa tới quần đảo Solomon",
        "desc": "Xuất kích hạm đội chính bao gồm Choukai Kai2 làm kì hạm và năm tàu bất kì trong số Aoba, Kinugasa, Kako, Furutaka, Tenryuu, Yuubari tới 5-1 và đạt S-Rank ở boss"
    },
    "274": {
        "name": "Tuần tra chống ngầm của đội khu trục số 6",
        "desc": "Triển khai Akatsuki, Hibiki (響 or Верный), Inazuma và Ikazuchi tới 1-5. Đạt ít nhất C-rank ở  boss"
    },
    "275": {
        "name": "Triển khai hạm đội số 18",
        "desc": "Tenryuu, Tatsuta, và ít nhất 2 tàu khác tới [W2-3] và Giành hạng S ở Boss"
    },
    "276": {
        "name": "Xuất kích đội tấn công mặt nước!",
        "desc": "Xuất kích Hiei, Kirishima, Nagara, Akatsuki, Ikazuchi, Inazuma tới 5-1 và đạt S-rank ở boss"
    },
    "277": {
        "name": "Nhiệm vụ chống ngầm đội khu trục số 6!",
        "desc": "Xuất kích Akatsuki Kai2 , Hibiki/Verniy, Ikazuchi, Inazuma tới 1-5 và đạt ít nhất A-rank ở boss"
    },
    "278": {
        "name": "Nhanh chóng gửi Đệ nhất phóng lôi Hải đoàn tới Chiến dịch KE",
        "desc": "Xuất kích Abukuma(Kai-2) làm kì hạm cùng với Hibiki/Вер, Hatsushimo, Wakaba, Samidare và Shimakaze tới boss 3-2 và đạt B-rank trở lên"
    },
    "279": {
        "name": "Nhanh chóng gửi Đệ nhất phóng lôi Hải đoàn tới Chiến dịch KE một lần nữa",
        "desc": "Xuất kích Abukuma Kai-2 làm kì hạm cùng với Hibiki/Вер, Yuugumo, Naganami, Akigumo và Shimakaze tới 3-2 và đạt ít nhất B-rank ở boss"
    },
    
    
    
    "201": {
        "code": "Bd1",
        "name": "Xuất Kích mỗi ngày 1",
        "desc": "Đánh bại một hạm đội Abyssal",
        "unlock": [ 216, 211, 212 ],
        "tracking": [ [0,1] ]
    },
    "216": {
        "code": "Bd2",
        "name": "Xuất Kích mỗi ngày 2",
        "desc": "Đánh bại kì hạm của một hạm đội Abyssal",
        "unlock": [ 210, 218, 214, 213 ],
        "tracking": [ [0,1] ]
    },
    "210": {
        "code": "Bd3",
        "name": "Xuất Kích mỗi ngày 3",
        "desc": "Đánh bại 10 hạm đội Abyssal (rank B trở lên)",
        "tracking": [ [0,10] ]
    },
    "211": {
        "code": "Bd4",
        "name": "Xuất Kích mỗi ngày 4",
        "desc": "Đánh chìm 3 CV(L) của Abyssal",
        "tracking": [ [0,3] ]
    },
    "218": {
        "code": "Bd5",
        "name": "Xuất Kích mỗi ngày 5",
        "desc": "Đánh chìm 3 tàu vận chuyển của Abyssal",
        "unlock": [ 226, 220 ],
        "tracking": [ [0,3] ]
    },
    "212": {
        "code": "Bd6",
        "name": "Xuất Kích mỗi ngày 6",
        "desc": "Đánh chìm 5 tàu vận chuyển của Abyssal",
        "tracking": [ [0,5] ]
    },
    "226": {
        "code": "Bd7",
        "name": "Xuất Kích mỗi ngày 7",
        "desc": "Đánh bại 5 boss ở World 2",
        "unlock": [ 230 ],
        "tracking": [ [0,5] ]
    },
    "230": {
        "code": "Bd8",
        "name": "Xuất Kích mỗi ngày 8",
        "desc": "Đánh chìm 6 tàu ngầm của Abyssal",
        "tracking": [ [0,6] ]
    },
    
    
    
    
    
    "214": {
        "code": "Bw1",
        "name": "Xuất Kích mỗi tuần 1",
        "desc": "Xuất kích 36 lần, Giao chiến 24 boss, Thắng 12 boss, đạt được 6 hạng S",
        "unlock": [ 221 ],
        "tracking": [ [0,36], [0,24], [0,12], [0,6] ]
    },
    "220": {
        "code": "Bw2",
        "name": "Xuất Kích mỗi tuần 2",
        "desc": "Đánh chìm 20 CV(L) của Abyssal",
        "unlock": [ 228 ],
        "tracking": [ [0,20] ]
    },
    "213": {
        "code": "Bw3",
        "name": "Xuất Kích mỗi tuần 3",
        "desc": "Đánh chìm 20 tàu chở hàng của Abyssal",
        "tracking": [ [0,20] ]
    },
    "221": {
        "code": "Bw4",
        "name": "Xuất Kích mỗi tuần 4",
        "desc": "Đánh chìm 50 tàu chở hàng của Abyssal",
        "unlock": [ 261, 257, 264 ],
        "tracking": [ [0,50] ]
    },
    "228": {
        "code": "Bw5",
        "name": "Xuất Kích mỗi tuần 5",
        "desc": "Đánh chìm 15 tàu ngầm của Abyssal",
        "unlock": [ 229, 241, 613 ],
        "tracking": [ [0,15] ]
    },
    "229": {
        "code": "Bw6",
        "name": "Xuất Kích mỗi tuần 6",
        "desc": "Đánh bại 12 boss ở World 4",
        "unlock": [ 242 ],
        "tracking": [ [0,12] ]
    },
    "241": {
        "code": "Bw7",
        "name": "Xuất Kích mỗi tuần 7",
        "desc": "Đánh bại 5 boss ở World [W3-3], [W3-4] hoặc [W3-5]",
        "tracking": [ [0,5] ]
    },
    "242": {
        "code": "Bw8",
        "name": "Xuất Kích mỗi tuần 8",
        "desc": "Đánh bại 1 boss ở World [W4-4]",
        "unlock": [ 243 ],
        "tracking": [ [0,1] ]
    },
    "243": {
        "code": "Bw9",
        "name": "Xuất Kích mỗi tuần 9",
        "desc": "Xuất Kích đến [W5-2] và giành hạng S khi đánh boss 2 lần",
        "tracking": [ [0,2] ]
    },
    "261": {
        "code": "Bw10",
        "name": "Xuất Kích mỗi tuần 10",
        "desc": "Xuất Kích đến [W1-5] và giành hạng A trở lên khi đánh boss 3 lần",
        "tracking": [ [0,3] ]
    },
    
    
    
    
    
    "249": {
        "code": "Bm1",
        "name": "Triển khai Hạm đội số 5",
        "desc": "Đưa Myoukou, Nachi, Haguro và +3 tàu khác đến [W2-5]. Giành hạng S ở Boss",
        "unlock": [ 265 ]
    },
    "256": {
        "code": "Bm2",
        "name": "Triển khai 1 đội tàu ngầm đến World 6-1",
        "desc": "Triển khai đến [W6-1] và giành hạng S ở Boss 3 lần",
        "tracking": [ [0,3] ]
    },
    "257": {
        "code": "Bm3",
        "name": "Triển khai 1 Hạm đội Ngư lôi",
        "desc": "1~3 CL (CL làm kì hạm) và 3~5 DD đến [W1-4]. Giành hạng S ở Boss"
    },
    "259": {
        "code": "Bm4",
        "name": "Triển khai 1 Hạm đội Tàu chiến",
        "desc": "Triển khai 3 BB(V) + 1 CL + 2 tàu khác đến [W5-1] và giành hạng S ở Boss"
    },
    "265": {
        "code": "Bm5",
        "name": "Hộ tống hằng tháng",
        "desc": "Triển khai 1 đội đến [W1-5] và giành hạng A tại Boss 10 lần",
        "tracking": [ [0,10] ]
    },
    "264": {
        "code": "Bm6",
        "name": "Triển khai Không mẫu Cơ động Bộ đội tới miền Tây",
        "desc": "2 CV + 2 DD + 2 tàu khác tới [W4-2]. Giành hạng S ở Boss",
        "unlock": [ 266 ]
    },
    "266": {
        "code": "Bm7",
        "name": "Triển khai Hạm đội Phản công",
        "desc": "4 DD (DD làm kì hạm) + 1 CA (không được dùng CAV) + 1 CL tới [W2-5] và giành hạng S ở Boss"
    },
    
    
    
    
    
    "301": {
        "code": "C1",
        "name": "Luyện tập đầu tiên!",
        "desc": "Thách thức một hạm đội khác trong chế độ Luyện tập"
    },
     "303": {
        "code": "C2",
        "name": "Luyện tập mỗi ngày 1",
        "desc": "Thách thức 3 hạm đội khác trong chế độ Luyện tập",
        "unlock": [ 304, 302 ],
        "tracking": [ [0,3] ]
    },
    "304": {
        "code": "C3",
        "name": "Luyện tập mỗi ngày 2",
        "desc": "Giành được 5 chiến thắng trong chế độ Luyện tập trong cùng một ngày",
        "tracking": [ [0,5] ]
    },
    "302": {
        "code": "C4",
        "name": "Luyện tập mỗi tuần",
        "desc": "Giành được 20 chiến thắng trong chế độ Luyện tập",
        "tracking": [ [0,20] ]
    },
    "307": {
        "code": "C5",
        "name": "Tăng cường độ hiệu quả của hạm đội",
        "desc": "Giành được 3 chiến thắng trong chế độ Luyện tập"
    },
    "308": {
        "code": "C6",
        "name": "Tăng cường độ hiệu quả của hạm đội thêm lần nữa",
        "desc": "Giành được 4 chiến thắng trong chế độ Luyện tập"
    },
    "309": {
        "code": "C7",
        "name": "Phấn đấu tăng cường rèn luyện để chuẩn bị một cuộc tấn công nữa lên vùng biển phía Bắc",
        "desc": "Giành được 4 chiến thắng trong chế độ Luyện tập trong cùng ngày"
    },
    
    
    
    
    "401": {
        "code": "D1",
        "name": "Viễn chinh đầu tiên",
        "desc": "Thực hiện một cuộc viễn chinh"
    },
    "402": {
        "code": "D2",
        "name": "Viễn chinh mỗi ngày 1",
        "desc": "Thực hiện 3 cuộc viễn chinh thành công",
        "unlock": [ 403 ],
        "tracking": [ [0,3] ]
    },
    "403": {
        "code": "D3",
        "name": "Viễn chinh mỗi ngày 2",
        "desc": "Thực hiện 10 cuộc viễn chinh thành công",
        "tracking": [ [0,10] ]
    },
    "404": {
        "code": "D4",
        "name": "Viễn chinh mỗi tuần",
        "desc": "Thực hiện 30 cuộc viễn chinh thành công",
        "tracking": [ [0,30] ]
    },
    "405": {
        "code": "D5",
        "name": "Chiến dịch tàu ngầm lần thứ nhất",
        "desc": "Hoàn thành chuyến viễn chinh số 30"
    },
    "406": {
        "code": "D6",
        "name": "Chiến dịch tàu ngầm lần thứ hai",
        "desc": "Hoàn thành chuyến viễn chinh số 30 thêm một lần nữa"
    },
    "408": {
        "code": "D7",
        "name": "Tiếp tục chiến dịch tàu ngầm",
        "desc": "Hoàn thành chuyến viễn chinh số 30 thêm hai lần nữa"
    },
    "409": {
        "code": "D8",
        "name": "Cuộc hội ngộ chiến lược với hạm đội tàu ngầm bên kia đại dương, xuất kích!",
        "desc": "Hoàn thành chuyến viễn chinh số 31"
    },
    "410": {
        "code": "D9",
        "name": "Viễn chinh mỗi tuần 2",
        "desc": "Hoàn thành Viễn chinh 37 hoặc 38",
        "unlock": [ 411 ],
        "tracking": [ [0,1] ]
    },
    "412": {
        "code": "D10",
        "name": "Tăng cường hoạt động của Hàng không Thiết giáp hạm",
        "desc": "Hoàn thành chuyến viễn chinh số 23"
    },
    "411": {
        "code": "D11",
        "name": "Viễn chinh mỗi tuần 3",
        "desc": "Hoàn thành Viễn chinh 37 hoặc 38 (hoàn thành một cái ít nhất 7 lần)",
        "tracking": [ [0,7] ]
    },
    "413": {
        "code": "D12",
        "name": "Tăng cường hoạt động của Hàng không Thiết giáp hạm (Tiếp theo)",
        "desc": "Hoàn thành chuyến viễn chinh số 23 thêm bốn lần nữa"
    },
    "414": {
        "code": "D13",
        "name": "Chiến dịch Tàu ngầm ở vùng biển Xanh",
        "desc": "Hoàn thành chuyến viễn chinh số 39"
    },
    "415": {
        "code": "D14",
        "name": "Chiến dịch tàu ngầm mở rộng ở vùng biển Xanh",
        "desc": "Hoàn thành cuyến viễn chinh số 39 thêm 2 lần nữa"
    },
    "416": {
        "code": "D15",
        "name": "Diễn tập phòng không",
        "desc": "Hoàn thành chuyến viễn chinh số 6 ba lần"
    },
    "417": {
        "code": "D16",
        "name": "Triển khai lực lượng nghi binh",
        "desc": "Hoàn thành chuyến viễn chinh số 15"
    },
    "418": {
        "code": "D17",
        "name": "Chuẩn bị cho nghi lễ Hải quân",
        "desc": "Hoàn thành chuyến viễn chinh số 7 hai lần "
    },
    "419": {
        "code": "D18",
        "name": "Nghi lễ Hải quân",
        "desc": "Hoàn thành chuyến viễn chinh số  8"
    },
    
    
    
    
    
    "501": {
        "code": "E1",
        "name": "Tiếp tế đầu tiên",
        "desc": "Tiếp tế cho một tàu"
    },
    "502": {
        "code": "E2",
        "name": "Sửa chữa đầu tiên",
        "desc": "Sửa chữa một tàu"
    },
    "503": {
        "code": "E3",
        "name": "Sửa chữa mỗi ngày",
        "desc": "Sửa chữa 5 tàu",
        "unlock": [ 504 ],
        "tracking": [ [0,5] ]
    },
    "504": {
        "code": "E4",
        "name": "Tiếp tế mỗi ngày",
        "desc": "Tiếp tế cho nữ hạm của bạn 15 lần",
        "tracking": [ [0,15] ]
    },
    
    
    
    
    
    "605": {
        "code": "F1",
        "name": "Chế thiết bị mỗi ngày 1",
        "desc": "Chế tạo 1 thiết bị (Thất bại cũng được)",
        "unlock": [ 606 ],
        "tracking": [ [0,1] ]
    },
    "606": {
        "code": "F2",
        "name": "Đóng tàu mỗi ngày 1",
        "desc": "Đóng 1 tàu",
        "unlock": [ 607 ],
        "tracking": [ [0,1] ]
    },
    "607": {
        "code": "F3",
        "name": "Chế thiết bị mỗi ngày 2",
        "desc": "Chế tạo 3 thiết bị (có thể thất bại)",
        "unlock": [ 608 ],
        "tracking": [ [0,3] ]
    },
     "608": {
        "code": "F4",
        "name": "Đóng tàu mỗi ngày 2",
        "desc": "Đóng 3 tàu",
        "unlock": [ 609, 619 ],
        "tracking": [ [0,3] ]
    },
     "609": {
        "code": "F5",
        "name": "Dỡ bỏ mỗi ngày",
        "desc": "Phá dỡ 2 tàu",
        "tracking": [ [0,2] ]
    },
    "601": {
        "code": "F6",
        "name": "Đóng tàu lần đầu",
        "desc": "Đóng 1 tàu"
    },
    "602": {
        "code": "F7",
        "name": "Chế thiết bị lần đầu",
        "desc": "Chế tạo một thiết bị"
    },
    "603": {
        "code": "F8",
        "name": "Dỡ tàu lần đầu",
        "desc": "Phá dỡ một tàu"
    },
    "604": {
        "code": "F9",
        "name": "Tháo dỡ thiết bị lần đầu",
        "desc": "Tháo dỡ một thiết bị"
    },
    "610": {
        "code": "F10",
        "name": "Chuẩn bị cho Đóng tàu cỡ lớn (Phần 2)",
        "desc": "Tháo dỡ 4 thiết bị"
    },
    "612": {
        "code": "F11",
        "name": "Chuẩn bị thùng chuyên chở",
        "desc": "Tháo dỡ thiết bị 3 lần"
    },
     "613": {
        "code": "F12",
        "name": "Huỷ bỏ thiết bị hằng tuần",
        "desc": "Huỷ bỏ 24 thiết bị",
        "tracking": [ [0,24] ]
    },
     "614": {
        "code": "F13",
        "name": "Nâng cấp phiên bản (thành Tenzan)",
        "desc": "Có kì hạm trang bị Type 97 Torpedo Bomber (Tomonaga Squadron), sau đó tháo dỡ 2 Tenzan"
    },
    "615": {
        "code": "F14",
        "name": "Nâng cấp phiên bản (thành Suisei)",
        "desc": "Có kì hạm trang bị Type 99 Dive Bomber (Egusa Squadron), sau đó tháo dỡ 2 Suisei"
    },
    "616": {
        "code": "F15",
        "name": "Nâng cấp phiên bản (thành Reppuu)",
        "desc": "Có kì hạm trang bị Zero Fighter Type 52 Type C (601 Air Group), sau đó tháo dỡ 2 Reppuu"
    },
    "617": {
        "code": "F16",
        "name": "Chuẩn bị cho Irako",
        "desc": "Tháo dỡ thiết bị 10 lần"
    },
    "618": {
        "code": "F17",
        "name": "Hiện đại hóa Trang bị đầu tiên",
        "desc": "Thực hiện Hiện đại hóa Trang bị 1 lần"
    },
    "619": {
        "code": "F18",
        "name": "Hiện đại hóa Trang bị mỗi ngày",
        "desc": "Thực hiện Hiện đại hóa Trang bị 1 lần",
        "tracking": [ [0,1] ]
    },
    
    
    
    
    
    "701": {
        "code": "G1",
        "name": "Hiện đại hóa đầu tiên",
        "desc": "Thực hiện 1 lần Hiện đại hóa thành công"
    },
    "702": {
        "code": "G2",
        "name": "Hiện đại hóa mỗi ngày",
        "desc": "Thực hiện 2 lần Hiện đại hóa thành công",
        "unlock": [ 703 ],
        "tracking": [ [0,2] ]
    },
    "703": {
        "code": "G3",
        "name": "Hiện đại hóa mỗi tuần",
        "desc": "Thực hiện 15 lần Hiện đại hóa thành công",
        "tracking": [ [0,15] ]
    },
    "704": {
        "code": "G4",
        "name": "Chuẩn bị cho Đóng tàu cỡ lớn (Phần 1)",
        "desc": "Thực hiện 4 lần Hiện đại hóa thành công"
    },
    
    
    
    
    
    "611": {
        "name": "Chuẩn bị cho tình yêu! (Phần 1)",
        "desc": "Tháo dỡ thiết bị 2 lần để thể hiện tình yêu!"
    },
    "306": {
        "name": "Chuẩn bị cho tình yêu! (Phần 2)",
        "desc": "Thể hiện tình yêu bằng cách chiến thắng hai trận trong chế độ Luyện tập."
    }
}